/* --- 01 ---
  Створити змінну let, яка зберігатиме вік користувача. 
  Присвоїти їй числове значення від 1 до 99. 
  Вивести змінну в консоль.
  let userAge = 22;
  console.log(userAge);
*/

/* --- 02 ---
  Присвоїти виществореній змінній інше значення - число від 1 до 99.
  Вивести цю змінну в консоль.
  userAge = 23;
  console.log(userAge);
*/

/* --- 03 ---
  Створити константу, яка зберігатиме дату народження у форматі ДД.ММ.РР. 
  Вивести цю дату за допомогою функції alert()
  const dataBirthday = '23.09.1999';
  alert(dataBirthday);
*/